# panadas ==> an open souce library that is used for handle data manipulation

In [1]:
# data structure :
# 1. series 2. dataframe

In [2]:
import pandas as pd

In [6]:
a=pd.Series([1,3,5,23,21])
a

0     1
1     3
2     5
3    23
4    21
dtype: int64

In [7]:
type(a)

pandas.core.series.Series

2. DataFrame

In [9]:
a={
    "Emp_ID":[1,2,3,4,5,6,7,8],
    "Name":['Sam','Mohit','Ram','Raju','Vivek','Rajesh','Vansh','Dulesh'],
    "Department":['IT','HR','HR','HR','HR','Operation','IT','HR'],
    "Working_Hour":[8,9,9,9,9,9,6,7]
}

In [10]:
type(a)

dict

In [11]:
df=pd.DataFrame(a)
df

   Emp_ID    Name Department  Working_Hour
0       1     Sam         IT             8
1       2   Mohit         HR             9
2       3     Ram         HR             9
3       4    Raju         HR             9
4       5   Vivek         HR             9
5       6  Rajesh  Operation             9
6       7   Vansh         IT             6
7       8  Dulesh         HR             7

In [12]:
df.head() ###return top 5 data

   Emp_ID   Name Department  Working_Hour
0       1    Sam         IT             8
1       2  Mohit         HR             9
2       3    Ram         HR             9
3       4   Raju         HR             9
4       5  Vivek         HR             9

In [14]:
df.columns

Index(['Emp_ID', 'Name', 'Department', 'Working_Hour'], dtype='object')

In [15]:
df.head(2)

   Emp_ID   Name Department  Working_Hour
0       1    Sam         IT             8
1       2  Mohit         HR             9

In [16]:
df.head(6)

   Emp_ID    Name Department  Working_Hour
0       1     Sam         IT             8
1       2   Mohit         HR             9
2       3     Ram         HR             9
3       4    Raju         HR             9
4       5   Vivek         HR             9
5       6  Rajesh  Operation             9

In [17]:
df.tail() ###return bottom 5 data

   Emp_ID    Name Department  Working_Hour
3       4    Raju         HR             9
4       5   Vivek         HR             9
5       6  Rajesh  Operation             9
6       7   Vansh         IT             6
7       8  Dulesh         HR             7

In [18]:
df.tail(2)

   Emp_ID    Name Department  Working_Hour
6       7   Vansh         IT             6
7       8  Dulesh         HR             7

In [24]:
 df.sample(4) #return random indexed rows

   Emp_ID    Name Department  Working_Hour
3       4    Raju         HR             9
6       7   Vansh         IT             6
5       6  Rajesh  Operation             9
4       5   Vivek         HR             9

In [21]:
df.describe() # return statically view of data

        Emp_ID  Working_Hour
count  8.00000      8.000000
mean   4.50000      8.250000
std    2.44949      1.164965
min    1.00000      6.000000
25%    2.75000      7.750000
50%    4.50000      9.000000
75%    6.25000      9.000000
max    8.00000      9.000000

In [22]:
df.info() # return complete overview of data

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Emp_ID        8 non-null      int64
 1   Name          8 non-null      object
 2   Department    8 non-null      object
 3   Working_Hour  8 non-null      int64
dtypes: int64(2), object(2)
memory usage: 388.0+ bytes

In [25]:
# if you wnat to export your data incsv format

In [26]:
df.to_csv("C:\\Users\\DIVYANSHU YADAV\\OneDrive\\Desktop\\New folder (2)\\first.csv")

In [27]:
df.to_csv("C:\\Users\\DIVYANSHU YADAV\\OneDrive\\Desktop\\New folder (2)\\my_first.csv",index=False)

# how to read a csv into jupyter notebook

In [30]:
df.to_excel("C:\\Users\\DIVYANSHU YADAV\\OneDrive\\Desktop\\New folder (2)\\exfirst.xlsx")

In [32]:
df=pd.read_csv("F:\\ml1.csv")

In [33]:
df.head()

   YearsExperience  Salary
0              1.1   39343
1              1.3   46205
2              1.5   37731
3              2.0   43525
4              2.2   39891

In [37]:
df['Salary'].value_counts()

39343     1
46205     1
122391    1
112635    1
116969    1
105582    1
109431    1
113812    1
101302    1
98273     1
91738     1
93940     1
81363     1
83088     1
66029     1
67938     1
61111     1
57081     1
56957     1
55794     1
63218     1
57189     1
64445     1
54445     1
60150     1
56642     1
39891     1
43525     1
37731     1
121872    1
Name: Salary, dtype: int64

In [38]:
a={
    "Emp_ID":[1,2,3,4,5,6,7,8],
    "Name":['Sam','Mohit','Ram','Raju','Vivek','Rajesh','Vansh','Dulesh'],
    "Department":['IT','HR','HR','HR','HR','Operation','IT','HR'],
    "Working_Hour":[8,9,9,9,9,9,6,7]
}

In [40]:
df=pd.DataFrame(a)
df

   Emp_ID    Name Department  Working_Hour
0       1     Sam         IT             8
1       2   Mohit         HR             9
2       3     Ram         HR             9
3       4    Raju         HR             9
4       5   Vivek         HR             9
5       6  Rajesh  Operation             9
6       7   Vansh         IT             6
7       8  Dulesh         HR             7

In [42]:
df['Name'][0]='Radha'

C:\Users\DIVYANSHU YADAV\AppData\Local\Temp\ipykernel_1972\1545602792.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Name'][0]='Radha'

In [43]:
df.head()

   Emp_ID   Name Department  Working_Hour
0       1  Radha         IT             8
1       2  Mohit         HR             9
2       3    Ram         HR             9
3       4   Raju         HR             9
4       5  Vivek         HR             9

In [44]:
df['Working_Hour'][5]='2'

C:\Users\DIVYANSHU YADAV\AppData\Local\Temp\ipykernel_1972\187254252.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Working_Hour'][5]='2'

In [46]:
df.head(8)

   Emp_ID    Name Department Working_Hour
0       1   Radha         IT            8
1       2   Mohit         HR            9
2       3     Ram         HR            9
3       4    Raju         HR            9
4       5   Vivek         HR            9
5       6  Rajesh  Operation            2
6       7   Vansh         IT            6
7       8  Dulesh         HR            7

In [47]:
# loc and iloc

# df.loc["row_range","column_name"]
# df.iloc["row_range","column_range"]

In [48]:
df.loc[2]

Emp_ID            3
Name            Ram
Department       HR
Working_Hour      9
Name: 2, dtype: object

In [50]:
df.loc[2,"Name"]

'Ram'

In [51]:
df.loc[2:5]

   Emp_ID    Name Department Working_Hour
2       3     Ram         HR            9
3       4    Raju         HR            9
4       5   Vivek         HR            9
5       6  Rajesh  Operation            2

In [52]:
df.loc[2:5,["Name","Department"]]

     Name Department
2     Ram         HR
3    Raju         HR
4   Vivek         HR
5  Rajesh  Operation

In [53]:
df.iloc[2]

Emp_ID            3
Name            Ram
Department       HR
Working_Hour      9
Name: 2, dtype: object

In [54]:
df.iloc[2:5]

   Emp_ID   Name Department Working_Hour
2       3    Ram         HR            9
3       4   Raju         HR            9
4       5  Vivek         HR            9

In [55]:
df.iloc[2:5,1:3]

    Name Department
2    Ram         HR
3   Raju         HR
4  Vivek         HR

In [57]:
df['Name'][2]=None

C:\Users\DIVYANSHU YADAV\AppData\Local\Temp\ipykernel_1972\2487297997.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Name'][2]=None

In [58]:
df['Department'][3]=None
df['Department'][4]=None

C:\Users\DIVYANSHU YADAV\AppData\Local\Temp\ipykernel_1972\1668653274.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Department'][3]=None
C:\Users\DIVYANSHU YADAV\AppData\Local\Temp\ipykernel_1972\1668653274.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Department'][4]=None

In [59]:
df

   Emp_ID    Name Department Working_Hour
0       1   Radha         IT            8
1       2   Mohit         HR            9
2       3    None         HR            9
3       4    Raju       None            9
4       5   Vivek       None            9
5       6  Rajesh  Operation            2
6       7   Vansh         IT            6
7       8  Dulesh         HR            7

In [60]:
df.isnull() #return true if you have missing value otherwise return false

   Emp_ID   Name  Department  Working_Hour
0   False  False       False         False
1   False  False       False         False
2   False   True       False         False
3   False  False        True         False
4   False  False        True         False
5   False  False       False         False
6   False  False       False         False
7   False  False       False         False

In [61]:
df.isnull().sum() #check total missing value

Emp_ID          0
Name            1
Department      2
Working_Hour    0
dtype: int64

In [62]:
df=df.dropna()
df

   Emp_ID    Name Department Working_Hour
0       1   Radha         IT            8
1       2   Mohit         HR            9
5       6  Rajesh  Operation            2
6       7   Vansh         IT            6
7       8  Dulesh         HR            7